packages/django-jbank/django-jbank-3.8.6.tar.gz/django-jbank-3.8.6/logs/ws/00000036a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pkif="http://danskebank.dk/PKI/PKIFactoryService" xmlns:elem="http://danskebank.dk/PKI/PKIFactoryService/elements">
  <soapenv:Header/>
  <soapenv:Body>
    <pkif:CreateCertificateIn>
      <pkif:RequestHeader>
        <pkif:SenderId>6D3142</pkif:SenderId>
        <pkif:CustomerId>6D3142</pkif:CustomerId>
        <pkif:RequestId>36</pkif:RequestId>
        <pkif:Timestamp>2020-07-20T23:24:20.122087+03:00</pkif:Timestamp>
        <pkif:InterfaceVersion>1</pkif:InterfaceVersion>
        <pkif:Environment>customertest</pkif:Environment>
      </pkif:RequestHeader>
    <EncryptedData xmlns="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Element">
<EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/>
<KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
<EncryptedKey xmlns="http://www.w3.org/2001/04/xmlenc#">
<EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/>
<KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
<X509Data>
<X509Certificate>MIIFATCCAumgAwIBAgIFAQjv8bkwDQYJKoZIhvcNAQELBQAwgZgxEDAOBgNVBAMT
B0RCR1JPT1QxCzAJBgNVBAYTAkRLMRMwEQYDVQQHEwpDb3BlbmhhZ2VuMRAwDgYD
VQQIEwdEZW5tYXJrMRowGAYDVQQKExFEYW5za2UgQmFuayBHcm91cDEaMBgGA1UE
CxMRRGFuc2tlIEJhbmsgR3JvdXAxGDAWBgNVBAUTDzYxMTI2MjI4MTExMDAwMzAe
Fw0yMDAyMDQxMjAwMDBaFw0yMjAyMDQxMjAwMDBaMIGYMRAwDgYDVQQDEwdEUENS
WVBUMQswCQYDVQQGEwJESzETMBEGA1UEBxMKQ29wZW5oYWdlbjEQMA4GA1UECBMH
RGVubWFyazEaMBgGA1UEChMRRGFuc2tlIEJhbmsgR3JvdXAxGjAYBgNVBAsTEURh
bnNrZSBCYW5rIEdyb3VwMRgwFgYDVQQFEw82MTEyNjIyODQ5MTAwMDkwggEgMA0G
CSqGSIb3DQEBAQUAA4IBDQAwggEIAoIBAQCmSUzQYj0Fx3jwvkz0lhmyyXRKwo5T
hts+1xFrG7euQ6oIMUJJpr8tgKxwDxdxxK/RXaYCHRH9mpIoyxCPlS3reRF4BMB6
gL2KOINnRyC3jmJ7kYHyWdhYfMb5VPIvusqPXc91HdVJb6rxvVSrTy/dB+V1od2q
uHNxA+Luhno37CXU1STrVvSrgHzOm45MROryuOu0lWY+d49tWZN9ilNI2Rf8mJjT
ZVKwJu4v02jXLGAqWpXQX0vxa7nI1D0xkOqnTvd04iDOdDE+jRtiy3SF8508LRqQ
jRH+9TZbX++yFd9Z/AR2h6AwM8OsLSC1QMJG7KeJw8st7K9i8KEOdglpAgEDo1Iw
UDAfBgNVHSMEGDAWgBTrVX/FmGlwJqoQ3fgyj1cJ40A/OjAdBgNVHQ4EFgQUMowN
BX+7Vy5lfO+d+tCxZ+ZupdYwDgYDVR0PAQH/BAQDAgQwMA0GCSqGSIb3DQEBCwUA
A4ICAQA+TV7cAPm5mKIAzTfuS4x4/KAlysTXZ3o0F2fYZmylNnUafi0+T21utPAv
bBYVFpr9fRq+q0L75ZCqU4pDvRLpHF7Q0RZ01ra7otVS78saxc/YUql+MsnHxeUw
9F8FJx7234KlRkhmY8xB743T/LQcp3zCRYUd0Rn2Ocaq7YoYGnx8QALItmJcagsX
MwYVsvXtWHHaDGFpcaivLX3e8cVQ+nI7slq1EfJ5xEdtSZ/zcGv+Ve4S6D1HLQ/K
oTQMzematrVvwwJMuqLMQdA1Pdtau3niupB3Se7AUq0bEZYF04Zlo4sOE21K9gSt
lJ5tSq0ohli02uXuQ/ggsqZSIH4t9WirWOMpS4KFkub02AYaicbm6SUyVg+odEaj
cFz+TEqd9C7cGgBL6MkLxXGj0DX64z4yU9lMlqQ8CzuZi5cMfpxvHVm4E+etLnYf
fzZ6jPnf3RbVumxPaRqnz6vceijWtmESg6cBei+phPzMCjjrXP0xng3+Bzqdn/lY
e8znS54o+UWJcENwvGc6tsUtBYGJOe6srIJHrXQKTG3DN6oDN2U5zT4cUBFvlHjx
fdj14m0Y0+gE90iTUJknWVRyyNDhPbYG1YCHRItVUxpGIp9tsV5FRP5qVbiMC7ba
hEsDAxMvL29i1vJbnJPT9e4OPkhEN5IqVQbu0QeOKMYT/YMZZQ==</X509Certificate>
</X509Data>
</KeyInfo>
<CipherData>
<CipherValue>InFR3GJ2lEn+ROJ0LbPPPP9RlMzI38ebmKjkcFCzX8N8mhZcnETKEZCcJ9eRkPJJ
NzlYXkjY6dqS1sP7DO4fFtmzURKuJDQTmWKAMH8f0VNGmaOwVkOyjGl394X+RM5e
9DS02FmjIcWJEmRP1fanDTpCtQe4/btyjlw5jjxIx30nyQiV2HgmDLOmGc5xUoqd
SkT2RxqofFqTF8JAkZqRyoNkF1Aqz/Zi/FLnQdbwDZc4dTeG3CkfwVnouPRd8+xh
vtvldP/wL9NRGdLWYkqJjGqXkpH4WZM3lXyCD2AfxDHZ7Aaq2OFfm84b7LQXU4og
bPN5aUfj+0BDs/NjHHiI2g==</CipherValue>
</CipherData>
</EncryptedKey>
</KeyInfo>
<CipherData>
<CipherValue>my+ldE9SeQVvMFMPDmH5Y0bnL/Encwo9+IKGpKQ6wmn6uZprdqrDpRhfOUv+VeU3
oQ5wGKOnqbq9APYMaNoBUzKogS8jlueP8eBoI3RpUEA7NtPPq663M6zRU9yRXb/1
xz86EuIjY4/+pDq0C3vUjZmzInjLOBWdBQyq3AngIB189RS43kSTGBm+IHLimt9y
Kbf0+1SQO53AC1456E2mwEwdM3DkUNFIOOpeN2ouLye7rxX5gQXwfOrjuMH8sFl6
NKPgaIbX4urHsiDGfdA7yYJSGN3nZ31iF9kX0lnFiDIjz1tVtHh7flEc8U87+nOd
eiWbxo3Qmmn5YE/iXC+Nh6+WNJ2jgCU+kjS2/wIz3JDlptfqtYnQIi8wOdLqtE0B
Rr0iPTam5clUIyFz+B/edYG/EO8L0pe4Kf0pPonSlspHieFZAON4prX7s2Ryu26J
P5iXa4FHbcKvePfvBCdDX2M7MF1vOpVSXN7RIsu+LFLxkhCY5NvnGtbp3untBuPp
O1wn4JF7IsbbQV89CtYayeZTl3qSXK/s+DZdVmanuRYrV2DEFYEZTeLAT8IExYaA
1/APsY3TONk9vlHCrtg0vLs2OmNFNStKKCU2/tM7ofZ3H3713wcwbaglgpUyHNWn
uwhSdd1WcWFmF8uoc2lI87fVweMt9iOBNvXVQCA3jiIBjz32CDa0m8/u79X68vGZ
MnerKLNByI/7VTr0cLg2kTBHZ9B9HlP1HPGGm4iXqJzURvZ+DxdZkkAkThC2QVLQ
f1P+eDhyBtxRJO4kojwvMwAw3xqJv9e4CmFHwRcxcNURTP2Ze92MEaGso011mgyL
JlzAeeifANYePZvE+Nj1TQLiEI2+cggrKUQyIxMmnPEdbvQFvTKTCdv8uFcqj0dM
aXPiSNqsiTzCEzIEdYIhsiVX2T1jgkMe4XldgWM7vgY3PBnU+HkXVhyV2kfUUMT0
zcOZqgp3exLpW2X1Pt83MjdRRJnLLc6U3ODfajX/H7PwgN0z30QjTHNGdVtn3XP6
lN0EPXSWdPOVZ5TeAuFzVgryBFXdgUVThrdhpzxPab8ljRZyqJR9pmMOzX91BJU2
TsBRWkFpJU0kxjIvj93Cjh0sTCty/VLFTV8GnkgSD3I9zdex1BUAdVkWsOnuH3fR
uKaoSNDRSymRCeIAz0XHg9taL1qsoN9lixFeBypinAAz68t7iSijGmM7rKujGC5a
Ii6zyursqePpApvM02EQT16hl5OYjLwYMhOkHlIuN5Uxkgxt5OoBZQgxdMp7eUWL
nYlqZLJFbgvif8j8GoItp9JJloeSBvkd7+kpgJ1DeglqDS+zvbWhmvp8fN6ufoZf
QT15duLHpd7W8ORiWQebOfKMMJjNsxXE+j2wwXrW+QUyQEc5a2HStI2/ciDi3fcj
heQxLvdV1jq954lV6zhiPKTAri6Kp96tx0ytL6krVo0g95VFqawESTH1Geh520em
TDHJNvZ7f/RjKWr3C6bIVPv5xZGcN+IJH/LRIs6HKIaIdmG1EpPybXj6/Qz434mr
MpStzVYHI6ZUT8+/UeN5XWi/AxMuZfA10xVTAM7OBlp+Zug1DyONkU2jwUjvUvnl
wbBjVn/icaTFF6JfqfWJIBFTHE0ELjJpWIkMriSzKvJJH9um8FELWo2oQnH1O7pw
s6NFqG8TkARitQNmfqCcyzeq50VtJKMFCeNRS7BUEbCF8H+RuJpV2qR8P6fRzrfx
3BDZ+8nr3FxHitGRJUZZ60PXa94RwEn73uGHQKWSiMO3tmuKl6ZVM4AUIWlAp/TK
5qp7eDg4lnZ+zS08uG5nhHarzymC3IlURvndc+IRc/kJKe1m/PWfmLgkI/mhj/9Q
8CAqKHoKfPhCv8nK4+MJ3U8RPgiI+xSp30uK2ay8jlEdQQ/xCEA+6iJWcPi3Eyp0
abd6b1VZc04PY22bPGT/qjuydjVzFJxEqXESDD7UTkghW0m5w8xMBWxdwReFR1df
F6b3ot+XOyo0cL5KsKXItKL3RKljayS0nQXdQNXDtktSM5I8Ig0YMdMAZWBexb7l
rHwl/nadikbXi+0ebPDu6qktP7ryS24T3F62e27EmqZj05/Ix/UQsGkif87iPDkj
c0bm2tSB2XizQV+vC7Pn/iPwlh6As1ijXEzfED45TsPLjpkQXyfPJ36BICzav8eP
JLwszJBPKQy2DV+vtRdIxFw37XfHBk+00aWG8pEguLMyDiKVwtxoiT/YrhcvGcMf
k9EP32DDvBcprWvxXVdqQ3aI0yh7eKph6qoJUwmZhz3bO3t2btkHdmoR+jd8AajU
gneXQA7A+G5Z+KhJ1+tbMEQCf6wh/Amj+9k8HmNY+x3Py1OTlKMdwX2V2oa6pJha
x5D9G4T8uh1KgIE1gWe9pFHMb/4SzGz61dvS5/Jx8yUBMFwkdDJa+X1FseiT4Ti3
cmoxUx7QTzKKpalFRiydZBv2Bn7hUKQjrmXo26zU1ELjOws+swpRtcx/2dF5hNcT
OMI2PJ55kJdD6W252+ffWaNugHymcxmCE2Z8yk5GKsSHWHEMTJn1jikWm52SqZ/L
WxXys1o/htXJPID7vqfaCttHfOqsBDATbmUS/U4RzNWn6Igg6yiRLib9MchCjB0G
czRNdAcNoKb8ONW32mSoIIAKG0vgiP0lxhra140Y+7vFyvUWereo4fgi27P7n9OX
iQ/tJgjapdQLvikaVI2rGqvsaMfGAMucvkSZ653QlbFESpe/l25G0GGKrjpsRbuL
2LnF9+1kRXbOTxMWMFoSS0ahV/12XmVJ3CiZ7dP6FPT0E5NB2v9+LnEZwQHonqGE
JnFrhU75kRIXhc80KKcp39+ug1mnR+HTMX01jIYSbZ/Ly9osLrKeykCWB3ssMD3q
2ppxR6cu9CIp2vApNu8Xg2ZMzkShQc12FGhRJ++Lupja2CFyxI66utnHw6QYSMgG
dRCccEPzJ0IoxM3Hn17N1NLcVa4DNvlrA8qzgP03is2MiXvK3HhBZz6xC5RJOfjS
HY4M8c/zFkr2T5lt5YTEBhN5J64t2b7mf9Fvu8qxtE69Qx58zHDQjk4cOZ9utmbc
xHXbgKT3Wq/ToiYJdV8sPErg3AI2b6Nb2GKlSebCd9TOqkaJmLUAe8agKyoRpe5A
305xlPA6adfljznyhQVrH9HvDqON8/dnH+32BMAgiQXmL4v7jekyoHd+zaoZ9LlO
88csqrl2ON5XaIGrh6A2+Cd+oSNPTMBfqjjddrIstzfwwWqIIiLW4+lwNneMVevj
clC+6rf89r7OXHHJbfK6N6Xar7MzeWvAQjfkhucFKmksKkbR6igC84o7bG0TANxX
gp4czOj9Wv2StdzOAblpR2ElliztXj390NdoVJXjETZoxtqb15VJtwELWmPbGfGb
bvq/2I2/q91LT6I8/PxEG6I/eZvJHKDOU4fjTcYAMQdtyWtsKMoGowgBkGtkcF2M
tTcM+MZF56vZTSDsl/M/Ko2OUbLjVFWUfcO/UQmRAcbkM2uyGAOJGMfKtghbEMwN
GXnx+zEdfueU7gkmnxHUHLkIN+Tc/IlQbMTvBSSzU57XYjnwHH0EjVNae5io3CDv
squLfvS/mJ2SqIJf21vaDauwgl8SNNLxzomL+uTdzDcnc8CzkOb2mfXuvAQRoE6D</CipherValue>
</CipherData>
</EncryptedData></pkif:CreateCertificateIn>
  </soapenv:Body>
</soapenv:Envelope>